app/Models/MsgModel.php

    public function inboxMsg($username)
    {

        $msg = $this
            ->asArray()
            ->where(['receiver_id' => $username])
            ->where(['receiver_label_id' => 1])
            ->join('users','users.username = email.sender_id','LEFT')
            ->select("email.*")
            ->select('users.first_name, users.last_name')
            ->orderBy('id', 'DESC')
            ->findAll();
---
SELECT `email`.*, `users`.`first_name`, `users`.`last_name`
FROM `email`
LEFT JOIN `users` ON `users`.`username` = `email`.`sender_id`
WHERE `receiver_id` = 'bb'
AND `receiver_label_id` = 1
ORDER BY `id` DESC

    public function sentMsg($username)
    {
        $msg = $this
            ->asArray()
            ->where(['sender_id' => $username])
            ->where(['sender_label_id' => 2])
            ->join('users','users.username = email.receiver_id','LEFT')
            ->select("email.*")
            ->select('users.first_name, users.last_name')
            ->orderBy('id', 'DESC')
            ->findAll();
---
SELECT `email`.*, `users`.`first_name`, `users`.`last_name`
FROM `email`
LEFT JOIN `users` ON `users`.`username` = `email`.`receiver_id`
WHERE `sender_id` = 'bb'
AND `sender_label_id` = 2
ORDER BY `id` DESC

    public function trashMsg($username)
    {
        $msg = $this
            ->asArray()
            ->where(['receiver_id' => $username])
            ->where(['receiver_label_id' => 4])
            ->orGroupStart()
               ->where(['sender_id' => $username])
               ->where(['sender_label_id' => 4])
            ->groupEnd()
            ->join('users','users.username = email.receiver_id','LEFT')
            ->select("email.*")
            ->select('users.first_name, users.last_name')
            ->orderBy('id', 'DESC')
            ->findAll();
---
SELECT `email`.*, `users`.`first_name`, `users`.`last_name`
FROM `email`
LEFT JOIN `users` ON `users`.`username` = `email`.`sender_id`
WHERE `receiver_id` = 'bb'
AND `receiver_label_id` = 4
OR   (
`sender_id` = 'bb'
AND `sender_label_id` = 4
 )
ORDER BY `id` DESC

    public function draftsMsg($username)
    {

        $msg = $this
            ->asArray()
            ->where(['sender_id' => $username])
            ->where(['sender_label_id' => 3])
            ->join('users','users.username = email.receiver_id','LEFT')
            ->select("email.*")
            ->select('users.first_name, users.last_name')
            ->orderBy('id', 'DESC')
            ->findAll();
---
SELECT `email`.*, `users`.`first_name`, `users`.`last_name`
FROM `email`
LEFT JOIN `users` ON `users`.`username` = `email`.`receiver_id`
WHERE `sender_id` = 'bb'
AND `sender_label_id` = 3
ORDER BY `id` DESC